app/controllers/drafts_controller.rb

SELECT title, id FROM "drafts" ORDER BY created_at DESC
---
  def index
     @drafts = Draft.all(:select => "title, id", :order => "created_at DESC")