app/controllers/posts_controller.rb

  def index
    @posts = Post.all(:select => "title, author, id, content, posted_at", :order => "posted_at DESC", :limit => 15)
---
SELECT title, author, id, content, posted_at FROM "posts" ORDER BY posted_at DESC LIMIT 15